[
	{ "title": "A Woodsrunners Diary", "url": "https://www.woodsrunnersdiary.blogspot.com/", "description": "A Woodsrunner's Diary explores 17th and 18th-century living history and historical trekking. The blog covers various aspects of period wilderness living, including skills, crafts, clothing styles, and equipment used by woodsmen and frontiersmen of the era. It aims to bring history to life by emulating the lifestyles and trades of people from the New World frontier between 1680 and 1760." },
	{ "title": "Eaton Rapids Joe", "url": "https://www.eatonrapidsjoe.blogspot.com/", "description": "Eaton Rapids Joe is a blog that covers a wide range of topics related to survival, preparedness, and self-reliance. The blog offers personal insights, practical advice, and detailed guides on various aspects of prepping, including food storage, gardening, and emergency planning." },
	{ "title": "Crisis Equipped", "url": "https://www.crisisequipped.com/blog/", "description": "Crisis Equipped provides resources and information on emergency preparedness and disaster management. The blog covers a wide range of topics, including natural disasters, personal safety, and survival skills, offering practical tips and strategies to help individuals and families prepare for and respond to crises effectively." },
    { "title": "Modern Survival Blog", "url": "https://www.modernsurvivalblog.com", "description": "Modern Survival Blog provides practical advice on emergency preparedness, self-reliance, and survival skills. The site covers a wide range of topics, including food storage, security, and disaster planning, aiming to help readers prepare for and survive various emergencies." },
	{ "title": "Prep School Daily", "url": "http://www.prepschooldaily.blogspot.com/", "description": "Prep School Daily offers tips and strategies for emergency preparedness and self-reliance. The blog covers a wide range of topics, including food storage, self-defense, and disaster planning, helping readers develop comprehensive preparedness plans and improve their chances of survival." },
	{ "title": "Prepared For Survival", "url": "http://www.preparedforsurvival.blogspot.com/", "description": "Prepared For Survival provides practical advice and strategies for long-term survival after disasters. The blog covers essential topics such as survival supplies, building urban survival kits, and primitive survival skills, aiming to help individuals prepare effectively for various emergencies." },
	{ "title": "Prepology", "url": "https://www.prepology.blogspot.com/", "description": "Prepology provides practical tips and advice on emergency preparedness and survival. The blog covers a variety of topics, including food storage, self-defense, and survival gear, helping readers develop effective preparedness plans." },
    { "title": "Prepper Handbook Blog", "url": "https://www.prepperhandbook.blogspot.com/", "description": "Prepper Handbook Blog offers detailed guides and advice on emergency preparedness and survival. The blog covers topics such as food storage, water purification, and self-defense, providing readers with comprehensive information to enhance their preparedness." },
    { "title": "Prepper Soft", "url": "https://www.preppersoft.com/blog/", "description": "Prepper Soft focuses on providing software and tools for emergency preparedness. The blog offers practical advice on topics such as disaster planning, survival skills, and self-reliance, helping readers enhance their preparedness with the aid of technology." },
  	{ "title": "Rational Preparedness", "url": "https://www.rationalpreparedness.blogspot.com/", "description": "Rational Preparedness journals a sensible approach to preparing for both natural and man-made disasters. The blog emphasizes practical planning and cost-effective measures, avoiding extreme approaches. It covers topics like water purification, disaster planning, and emergency supplies, providing readers with realistic and actionable preparedness strategies." },
    { "title": "Survival & Preparedness System", "url": "https://www.survivalsystem.blogspot.com/", "description": "Survival & Preparedness System provides practical tips and advice on emergency preparedness and survival tactics. The blog covers a range of topics, including food storage, self-defense, and survival gear, helping readers develop comprehensive plans to handle various emergency situations." },
    { "title": "Survival Blog", "url": "https://www.survivalblog.com", "description": "Survival Blog is a well-known resource for preparedness and survival information. Founded by James Wesley Rawles, the site features articles on a wide range of topics, including food storage, self-defense, medical preparedness, and financial survival, offering valuable insights for preppers and survivalists." },
    { "title": "Surviving Life With Alpha Wolfe", "url": "https://www.survivinglifewithalphawolf.wordpress.com/", "description": "Surviving Life With Alpha Wolfe offers practical advice on emergency preparedness and self-reliance. The blog covers a variety of topics including food storage, self-defense, and sustainable living, providing readers with tips and strategies to enhance their preparedness." },
	{ "title": "Surviving in Argentina", "url": "https://www.ferfal.blogspot.com/", "description": "Surviving in Argentina, authored by Fernando 'Ferfal' Aguirre, provides insights and advice based on real-life experiences during Argentina's economic collapse. The blog covers topics such as economic survival, self-defense, and practical preparedness tips, helping readers learn from past crises." },
	{ "title": "The 7 Ps Blog", "url": "https://www.priorproperplanningpppp.blogspot.com/", "description": "The 7 Ps Blog provides practical tips and advice on emergency preparedness and survival skills. The blog covers a variety of topics including food storage, self-defense, and disaster planning, helping readers develop comprehensive preparedness plans." },
    { "title": "The Economic Collapse Blog", "url": "https://www.theeconomiccollapseblog.com/", "description": "The Economic Collapse Blog provides analysis and commentary on economic issues and potential crises. The site covers topics such as financial preparedness, investing in precious metals, and survival strategies, helping readers understand and prepare for economic downturns and collapses." },
    { "title": "The Merril Project", "url": "https://www.themerrillproject.com/blog/", "description": "The Merril Project provides practical tips and strategies for emergency preparedness and self-reliance. The blog covers topics such as food storage, water purification, and survival skills, offering readers valuable advice to enhance their preparedness and resilience." },
	{ "title": "The Prepared Christian", "url": "https://www.thepreparedchristian.blogspot.com/", "description": "The Prepared Christian offers a faith-based perspective on emergency preparedness and self-reliance. The blog covers topics such as disaster planning, food storage, and spiritual readiness, aiming to help Christians prepare for emergencies while maintaining their faith and values." },
    { "title": "The Survivalist Blog", "url": "https://www.thesurvivalistblog.net", "description": "The Survivalist Blog provides comprehensive information on emergency preparedness and survival skills. The site covers a wide range of topics, including food storage, self-defense, and disaster planning, helping readers develop effective strategies for various emergencies." },
	{ "title": "The Warrior Class", "url": "https://www.thewarriorclass.blogspot.com/", "description": "The Warrior Class focuses on tactical training and emergency preparedness. The blog offers practical advice on topics such as self-defense, firearms training, and survival skills, helping readers develop the knowledge and skills needed to protect themselves and their families." },
	{ "title": "Urban Survival Skills", "url": "https://www.get-urban-survival-skills.blogspot.com/", "description": "Urban Survival Skills provides practical tips and advice on emergency preparedness and self-reliance in urban settings. The blog covers topics such as food storage, self-defense, and disaster planning, helping readers develop comprehensive preparedness plans for urban environments." },
	{ "title": "What If It Is Today?", "url": "https://www.whatifitistoday.blogspot.com/", "description": "What If It Is Today? provides practical tips and advice on emergency preparedness and self-reliance. The blog covers a variety of topics, including food storage, self-defense, and sustainable living, helping readers enhance their preparedness and resilience." }  
]