[
  { "title": "Google Drive Survival Manuals", "url": "https://www.drive.google.com/drive/u/0/folders/1e81oLsiFGGrNhjJaONGwqFLpkKjji4d7", "description": "This Google Drive folder contains a collection of survival manuals, providing valuable information on various survival skills, techniques, and strategies. Users can access and download these documents to enhance their preparedness for different emergency scenarios." },
  { "title": "Internet Archive", "url": "https://www.archive.org/", "description": "The Internet Archive is a non-profit digital library offering free access to a vast collection of digital content, including books, movies, software, music, and archived web pages. It aims to provide universal access to all knowledge, preserving and making available millions of items for educational and historical purposes." },
  { "title": "Internet Archive Survival", "url": "https://www.archive.org/details/books?tab=collection&query=survival", "description": "The Internet Archive Survival collection includes a wide array of books and manuals on survival topics. These resources cover wilderness survival, urban preparedness, and self-reliance, offering valuable information for anyone interested in enhancing their survival skills." },
  { "title": "Internet Archive Military Manuals", "url": "https://www.archive.org/details/military-manuals", "description": "The Internet Archive's Military Manuals collection includes a wide range of military documents and manuals. These resources cover various topics such as survival skills, tactics, equipment maintenance, and training, providing valuable information for military enthusiasts and researchers." },
  { "title": "Internet Archive Survival Skills", "url": "https://www.archive.org/search?query=Survival+Skills&and%5B%5D=subject%3A%22Survival%22&and%5B%5D=subject%3A%22Survival+skills%22&and%5B%5D=subject%3A%22Wilderness+survival%22&and%5B%5D=subject%3A%22SKILLS%22&and%5B%5D=subject%3A%22DTIC+Archive%22&and%5B%5D=mediatype%3A%22texts%22", "description": "This collection on the Internet Archive focuses on survival skills, including texts on wilderness survival, emergency preparedness, and self-reliance. It provides access to a variety of resources that are useful for learning and improving survival techniques." },
  { "title": "Media Fire Site 1", "url": "https://www.mediafire.com/?jne5h4np3fabo8n", "description": "This MediaFire link provides access to a downloadable resource related to survival and preparedness. Users can access and download the file to gain valuable information on various aspects of survival." },
  { "title": "Media Fire Site 2", "url": "https://www.mediafire.com/?dy8y55cbt0n5aaa", "description": "This MediaFire link offers a downloadable file focused on emergency preparedness and survival strategies. The content is designed to help users enhance their knowledge and skills in handling survival situations." },
  { "title": "Media Fire Site 3", "url": "https://www.mediafire.com/?m4pa5omw98h1q4z", "description": "This MediaFire link contains a resource for survival enthusiasts, providing information on various survival techniques and preparedness strategies. Users can download the file to improve their readiness for different emergencies." },
  { "title": "Media Fire Site 4", "url": "https://www.mediafire.com/?t07tw2jok2p9bo7", "description": "This MediaFire link offers access to a downloadable document related to survival skills and preparedness. The resource includes valuable information to help users prepare for and manage emergency situations." },
  { "title": "Media Fire Site 5", "url": "https://www.mediafire.com/?lwv8ynhzma4hvma", "description": "This MediaFire link provides a downloadable file containing information on survival and emergency preparedness. Users can access the resource to enhance their knowledge and skills in survival techniques." },
  { "title": "Mini-Manual for the Urban Defender", "url": "https://www.static1.squarespace.com/static/622cbafd4ab19b7c0966d469/t/638a64ef6d1818153c7bb5b4/1670014192597/Mini+Manual+for+the+Urban+Defender+v5.pdf", "description": "The Mini-Manual for the Urban Defender is a comprehensive guide focused on urban survival and defense strategies. It covers various topics such as situational awareness, self-defense, and emergency planning, providing practical advice for surviving in urban environments." },
  { "title": "National Maps", "url": "https://www.web.archive.org/web/20160329103817/nationalmap.gov/small_scale/printable/reference.html#list", "description": "This archived page from the National Map provides access to printable reference maps of the United States. These maps are useful for navigation, planning, and gaining geographical insights for various purposes, including emergency preparedness." },
  { "title": "Prepper File Share", "url": "https://www.reddit.com/r/PrepperFileShare/", "description": "Prepper File Share is a subreddit dedicated to sharing files and resources related to prepping and survival. Members post and exchange documents, manuals, and other useful materials to help each other enhance their preparedness." },
  { "title": "Project Gutenberg", "url": "https://www.gutenberg.org/", "description": "Project Gutenberg is a digital library offering over 60,000 free eBooks, including many classic works of literature. The site provides easy access to a wide range of texts in various formats, supporting reading and education on numerous topics." },
  { "title": "Reddit Post 1", "url": "https://www.reddit.com/r/Survival/comments/ug5v1/building_the_ultimate_survival_library_please/", "description": "This Reddit post discusses building the ultimate survival library, where members share recommendations for essential books and resources on survival skills and preparedness. The post serves as a collaborative effort to compile valuable information for preppers." },
  { "title": "Seasoned Citizen Prepper Downloads", "url": "https://www.seasonedcitizenprepper.com/preparedness-downloads/", "description": "Seasoned Citizen Prepper offers a collection of downloadable resources focused on emergency preparedness. The site includes guides, checklists, and manuals designed to help users build their preparedness skills and knowledge." },
  { "title": "Self Reliance Free Online Books", "url": "https://www.reddit.com/r/selfreliance/comments/zqd33p/free_online_books_for_self_reliance_and/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "description": "This Reddit post provides links to free online books covering topics related to self-reliance and preparedness. The resources include a variety of texts that can help users develop skills for independent living and emergency readiness." },
  { "title": "Steves Page Firearm Manuals", "url": "https://www.stevespages.com/page7b.htm", "description": "Steve's Pages offers a comprehensive collection of firearm manuals, including user guides, parts lists, and maintenance instructions. The site is a valuable resource for firearm owners seeking detailed information on various makes and models." },
  { "title": "Steves Pages Gunsmithing and Reloading", "url": "https://www.stevespages.com/page7d.htm", "description": "This section of Steve's Pages focuses on gunsmithing and reloading manuals, providing detailed guides and instructions for maintaining and customizing firearms. It is an essential resource for those interested in firearm maintenance and ammunition reloading." },
  { "title": "Survivor Library Downloads", "url": "https://www.survivorlibrary.com/library-download.html", "description": "Survivor Library offers a collection of downloadable books and manuals on survival skills, self-sufficiency, and preparedness. The resources are aimed at helping individuals build knowledge and skills for surviving various emergency scenarios." },
  { "title": "The Preparedness Encyclopedia", "url": "https://www.fluidicice.com/tpe.html", "description": "The Preparedness Encyclopedia (TPE) is a comprehensive resource covering a wide range of topics related to emergency preparedness and survival. It includes detailed information, guides, and checklists to help users prepare for different types of disasters." },
  { "title": "True Prepper Library", "url": "https://www.trueprepper.com/survival-pdfs-downloads/", "description": "True Prepper Library offers a selection of downloadable PDFs on survival and preparedness topics. The library includes guides, manuals, and checklists designed to help users enhance their readiness for emergencies." },
  { "title": "Web GIS", "url": "https://www.webgis.com/terr_us75m.html", "description": "Web GIS provides access to a variety of geographical information system (GIS) resources, including detailed maps and data sets. These tools are useful for navigation, planning, and gaining geographical insights for various purposes." },
  { "title": "WikiPedia Download", "url": "https://www.en.wikipedia.org/wiki/Wikipedia:Database_download", "description": "Wikipedia offers a database download option, allowing users to obtain offline copies of its vast collection of articles. This resource is valuable for accessing information in situations where internet connectivity is limited or unavailable." }
]