[
  { "title": "Canadian Prepper", "url": "https://open.spotify.com/show/7E5LvPBfxlyvGW0EzmNTz6", "description": "The Canadian Prepper podcast discusses various aspects of emergency preparedness and survival strategies, focusing on practical advice, gear reviews, and interviews with experts in the field. It aims to help listeners become more self-reliant and ready for any disaster scenario." },
  { "title": "Casual Preppers Podcast", "url": "https://open.spotify.com/show/27pKTcu62mvb0J1R6xmRI1", "description": "Casual Preppers Podcast delivers a light-hearted yet informative take on prepping and survival. Hosts discuss preparedness tips, survival gear, and current events, making the topic accessible and engaging for both new and experienced preppers." },
  { "title": "Fieldcraft Survival", "url": "https://open.spotify.com/show/44jjiEXCNRCnHoGi73qy6D", "description": "Fieldcraft Survival covers a wide range of topics related to survival, tactics, defense, and preparedness. Hosted by experts from Fieldcraft Survival, the podcast provides insights into military and survival training, gear recommendations, and personal experiences in the field." },
  { "title": "Modern Outdoor Survival", "url": "https://open.spotify.com/show/2yYlHfJUh5mIkYG46iQ88l", "description": "Modern Outdoor Survival focuses on wilderness survival skills, outdoor adventure, and emergency preparedness. The podcast features expert interviews, survival tips, and discussions on gear and techniques for thriving in the wild." },
  { "title": "Practical Prepping", "url": "https://open.spotify.com/show/74PaZZEwpYPgijxHtahOHc", "description": "Practical Prepping offers actionable advice on emergency preparedness and self-reliance. The hosts discuss a variety of topics, including food storage, home security, and disaster planning, providing listeners with practical steps to enhance their preparedness." },
  { "title": "Ready Your Future", "url": "https://open.spotify.com/show/2BFd1rzUeK8g1BTDpvS9q2", "description": "Ready Your Future focuses on prepping, self-reliance, and emergency preparedness. The podcast features discussions on survival strategies, gear reviews, and interviews with experts, aiming to help listeners prepare for a wide range of potential emergencies." },
  { "title": "Survival", "url": "https://open.spotify.com/show/5JDHqI4nZe36mcOZI05sYI", "description": "The Survival podcast explores various survival scenarios and techniques, providing listeners with valuable insights into staying safe and prepared. Topics include wilderness survival, urban preparedness, and personal safety, making it a comprehensive resource for survival enthusiasts." },
  { "title": "Survival and Basic Badass Podcast", "url": "https://open.spotify.com/show/4YdMrZ4oWTPKv4YrcZgExg", "description": "The Survival and Basic Badass Podcast delivers straightforward advice on prepping and survival skills. The hosts cover a wide range of topics, from building bug-out bags to self-defense tactics, offering practical tips to help listeners become more resilient and prepared." },
  { "title": "Survival Punk", "url": "https://www.survivalpunk.com/", "description": "Survival Punk offers practical advice on prepping and self-reliance with a focus on frugality and DIY solutions. The site features articles, gear reviews, and tips on food storage, survival skills, and sustainable living, helping readers prepare for emergencies on a budget." },
  { "title": "The Survival Podcast", "url": "https://www.thesurvivalpodcast.com/", "description": "The Survival Podcast covers a wide range of topics related to self-sufficiency, preparedness, and sustainable living. Host Jack Spirko provides insights into gardening, homesteading, financial preparedness, and survival tactics, aiming to help listeners build a resilient lifestyle." },
  { "title": "The Survival Show", "url": "https://open.spotify.com/show/54PfWrTw1EF1rR7jZehvyo", "description": "The Survival Show offers expert advice on emergency preparedness, survival skills, and self-defense. The podcast features interviews with industry experts, gear reviews, and practical tips, providing listeners with valuable information to enhance their preparedness." },
  { "title": "The Survivalist Prepper Podcast", "url": "https://www.podcasts.apple.com/us/podcast/the-survivalist-prepper-podcast/id695268752?mt=2", "description": "The Survivalist Prepper Podcast discusses all aspects of prepping and survival, from basic preparedness to advanced survival skills. Hosts Dale and Lisa cover topics such as food storage, self-defense, and disaster planning, offering practical advice to help listeners prepare for any situation." }
]
